Repository: sheilagomes/wp-trad
Catalog: tm/GNOME_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: Cleaning whole of the Project:
pt_br: Limpando todo o Projeto:

source: This file has not been saved. Save it first and then compile.
pt_br: O arquivo não foi salvo. Salve-o primeiro e então compile.

source: The object file is up-to-date, there is no need to compile it again.
pt_br: O arquivo objeto está atualizado, não é necessário compilá-lo novamente.

source: No compile command has been specified for this type of file.
pt_br: Nenhum comando de compilação foi especificado para este tipo de arquivo.

source: Compile
pt_br: Compilar

source: Compiling file: %s...
pt_br: Compilando o arquivo: %s...

source: You have changed some of the compiler options of the project, would you like the next build action to perform a complete rebuild of the project?
pt_br: Você alterou algumas das opções de compilação do Projeto, você gostaria que a primeira ação de construção provocasse uma re-construção completa do Projeto?

source: Do you want to clear the list?
pt_br: Você deseja limpar a lista?

source: Include paths
pt_br: Caminhos dos includes

source: Libraries paths
pt_br: Caminhos das bibliotecas

source: Libraries and modules
pt_br: Bibliotecas e módulos

source: Stock Defines
pt_br: Definições de Elementos

source: Warning
pt_br: Aviso

source: Project does not have an executable configure script. Auto generate the Project first.
pt_br: O Projeto não tem um script executável 'configure'. Você deve autogerar o Projeto primeiro.

source: Configure
pt_br: Configurar

source: Configuring the Project...
pt_br: Configurando o Projeto....

source: The target executable of this Project is unknown
pt_br: O alvo executável deste Projeto é desconhecido

source: The target executable of this Project is not executable
pt_br: O alvo executável deste Projeto não é executável

source: The target executable does not exist for this Project
pt_br: O alvo executável não existe para este Projeto

source: Executable is not up-to-date.
pt_br: O executável não está atualizado.

source: Unable to execute Project. Check Settings->Commands.
pt_br: Impossível executar o Projeto. Verifique Definições->Comandos.

source: This file has not been saved. Save it first.
pt_br: Este arquivo não foi salvo. Salve-o primeiro.

source: Unable to execute file. Check Settings->Commands.
pt_br: Impossível executar o arquivo. Verifique Definições->Comandos.

source: _Execute program
pt_br: _Executar o programa

source: Select header file
pt_br: Arquivo de cabeçalho selecionado

source: Select source file
pt_br: Arquivo de código fonte selecionado

source: * Class name:
pt_br: * Nome da classe:

source: * Output Header File:
pt_br: * Arquivo Cabeçalho de Saída:

source: * Output Source File:
pt_br: * Arquivo Fonte de Saída:

source: GObject Class Template Builder
pt_br: Construtor de Modelo de Classe GObject

source: Generic C++ Class Builder
pt_br: Construtor de Classe C++ Genérica

source: Add to current Project?
pt_br: Adicionar ao Projeto atual?

source: Browse for the declaration file name.
pt_br: Navega para o nome do arquivo de declarações.

source: Enter the name for the class you want to add.
pt_br: Informe o nome da classe que deseja adicionar.

source: Enter the name of the class your new class will inherit from.
pt_br: Informe o nome da classe que a sua nova classe irá herdar.

source: This plugin will create a class of the type you specify and add it to your project. Note that the creating class's parameters will be taken from the active tab. Please be sure to fill all required fields marked by *.
pt_br: Este plugin irá criar uma classe do tipo especificado e vai adicioná-la ao seu Projeto. Note que os parâmetros da classe criada serão obtidos a partir da aba ativa. Por favor, tenha certeza de preencher todos os campos requeridos marcados com um *.

source: Virtual destructor
pt_br: Destructor virtual

source: Please check your required fields.
pt_br: Por favor, verifique os campos requeridos.

source: An error occurred when trying to write GObject Class Template. Check file permissions.
pt_br: Um erro ocorreu ao tentar escrever o Modelo de Classe GObject. Verifique as permissões do arquivo.

source: Please fill required fields.
pt_br: Por favor, preencha os campos requeridos.

source: Error in writing files
pt_br: Erro ao escrever arquivos

source: Start the debugging session
pt_br: Inicia a sessão de depuração

source: Load debugging target...
pt_br: Carrega o alvo de depuração...

source: Devhelp navigation operations
pt_br: Operações de navegação do Devhelp

source: Do_n't save
pt_br: _Não salvar

source: Theme
pt_br: Tema

source: Delete Theme
pt_br: Exclui Tema

source: Reload Session Defaults
pt_br: Recarrega os Padrões da Sessão

source: Reload System Defaults
pt_br: Recarrega os Padrões do Sistema

source: Space-seperated list of directory name patterns to ignore
pt_br: Lista separada por espaços de padrões de nomes de diretórios que devem ser ignorados

source: Space-seperated list of directory name patterns to match
pt_br: Lista separada por espaços de padrões de nomes de diretório que devem ser coincididos

source: Space-seperated list of file name patterns to ignore
pt_br: Lista separada por espaços de padrões de nomes de arquivos que devem ser ignorados

source: Space-seperated list of file name patterns to match
pt_br: Lista separada por espaços de padrões de nomes de arquivos que devem ser coincididos

source: _Save Theme As
pt_br: _Salvar Tema Como

source: Co_mment code
pt_br: Co_mentar código

source: S_how calltip
pt_br: _Exibir dica

source: _Toggle bookmark
pt_br: Al_ternar marcador

source: Auto formatting...
pt_br: Auto formatar

source: Error in auto formatting...
pt_br: Erro na autoformatação...

source: Error in auto formatting... Details: %s
pt_br: Erro na autoformatação... Detalhes: %s

source: Auto formatting completed
pt_br: Remove qualquer vestígio de tarefas completadas

source: Autosaved "%s"
pt_br: Autosalvamento de "%s" -- Falhou

source: Autosave "%s" -- Failed
pt_br: Autosalvamento de "%s" -- Falhou

source: Space-separated list of directory name patterns to ignore
pt_br: Lista separada por espaços de padrões de nomes de diretórios que devem ser ignorados

source: Space-separated list of directory name patterns to match
pt_br: Lista separada por espaços de padrões de nomes de diretório que devem ser coincididos

source: Space-separated list of file name patterns to match
pt_br: Lista separada por espaços de padrões de nomes de arquivos que devem ser coincididos

source: %s is not a '.h' file !
pt_br: "%s" não é um arquivo '.h'!

source: _Insert text
pt_br: I_nserir texto

source: C _template
pt_br: _Template do C

source: _CVS keyword
pt_br: Palavra-Chave _CVS

source: _General
pt_br: _Geral

source: _Header
pt_br: Cabeçal_ho

source: Insert a file header
pt_br: Insere um cabeçalho de arquivo

source: /_* GPL Notice */
pt_br: /_* Aviso GPL */

source: Insert GPL notice with C style comments
pt_br: Insere um aviso GPL com comentário no estilo C

source: /_/ GPL Notice
pt_br: /_/ Aviso GPL

source: Insert GPL notice with C++ style comments
pt_br: Insere um aviso GPL com comentário no estilo C++

source: _# GPL Notice
pt_br: _# Aviso GPL

source: Insert GPL notice with Python style comments
pt_br: Insere um aviso GPL com comentário no estilo Python

source: Current _Username
pt_br: Nome do _Usuário Atual

source: Insert name of current user
pt_br: Insere o nome do usuário atual

source: Current _Date & Time
pt_br: _Data e Hora Atuais

source: Insert current date & time
pt_br: Insere a data e hora atuais

source: Header File _Template
pt_br: Modelo de Arquivo de _Cabeçalho

source: Insert a standard header file template
pt_br: Insere um modelo padrão de arquivo de cabeçalho

source: ChangeLog entry
pt_br: Registro ChangeLog

source: Insert a ChangeLog entry
pt_br: Insere uma entrada no ChangeLog

source: Insert a switch template
pt_br: Insere um modelo de switch

source: Insert a for template
pt_br: Insere um modelo de for

source: Insert a while template
pt_br: Insere um modelo de while

source: Insert an if...else template
pt_br: Insere um modelo de if...else

source: _Author
pt_br: _Autor

source: Insert the CVS Author keyword (author of the change)
pt_br: Insere a palavra-chave CVS Author (autor da alteração)

source: _Date
pt_br: _Data

source: Insert the CVS Date keyword (date and time of the change)
pt_br: Insere a palavra-chave CVS Date (data e hora da alteração)

source: Insert the CVS Header keyword (full path revision, date, author, state)
pt_br: Insere a palavra-chave CVS Header (caminho completo, revisão, data, autor e estado)

source: Insert the CVS Id keyword (file revision, date, author)
pt_br: Insere a palavra-chave CVS Id (arquivo, revisão, data e autor)

source: _Log
pt_br: Iniciar _Sessão

source: Insert the CVS Log keyword (log message)
pt_br: Insere a palavra-chave CVS Log (mensagem de log)

source: _Name
pt_br: _Nome

source: Insert the CVS Name keyword (name of the sticky tag)
pt_br: Insere a palavra-chave CVS Name (nome da tag grudada)

source: _Revision
pt_br: _Revisão

source: Insert the CVS Revision keyword (revision number)
pt_br: Insere a palavra-chave CVS Revision (número da revisão)

source: _Source
pt_br: _Código Fonte

source: Insert the CVS Source keyword (full path)
pt_br: Insere a palavra-chave CVS Source (caminho completo)

source: File wizard operations
pt_br: Operações de arquivo de assistência

source: You must give a valid location to set the breakpoint.
pt_br: Você deve fornecer um local válido para definir o ponto de interrupção.

source: All breakpoints disabled.
pt_br: Todos os pontos de interrupção desabilitados

source: All breakpoints enabled.
pt_br: Todos os pontos de interrupção habilitados

source: All breakpoints removed.
pt_br: Todos os pontos de interrupção excluídos

source: Local Variables
pt_br: Variáveis Locais

source: Default format
pt_br: Formato padrão

source: Binary
pt_br: Binário

source: Signed decimal
pt_br: Decimal com sinal

source: Unsigned decimal
pt_br: Decimal sem sinal

source: Hex
pt_br: Hexa

source: Char
pt_br: Caractere

source: Inspect memory
pt_br: Inspeciona a memória

source: Program received signal %s (%s) and exited
pt_br: O programa recebeu o sinal %s (%s) e terminou

source: Program is ATTACHED. Do you still want to stop Debugger?
pt_br: O programa está ANEXADO. Ainda deseja parar o Depurador?

source: Unable to build user interface for Memory
pt_br: Impossível criar interface de usuário para a Memória

source: _Breakpoints...
pt_br: _Pontos de Interrupção...

source: Display the IDs of currently known threads
pt_br: Exibe os IDs dos threads conhecidos no momento

source: Info _Local variables
pt_br: Info sobre Variáveis _Locais

source: Display local variables of the current frame
pt_br: Exibe variáveis locais do frame atual

source: Examine _Memory
pt_br: Examinar a _Memória

source: Display accessible memory
pt_br: Exibir a memória acessível

source: _Restart Program
pt_br: _Reiniciar o Programa

source: Stop and restart the program
pt_br: Para e reinicia o programa

source: S_top Program
pt_br: _Parar o Programa

source: Stop the program being debugged
pt_br: Para o programa sendo depurado

source: _Detach Debugger
pt_br: _Desanexar o Depurador

source: Detach from an attached program
pt_br: Desanexa de um programa anexado

source: Si_gnal to Process
pt_br: _Envia um Sinal para o Processo

source: Send a kernel signal to the process being debugged
pt_br: Enviando sinal de kernel para o processo sendo depurado

source: Add Expression in _Watch...
pt_br: Adicionar uma Expressão ao _Observador...

source: Add expression or variable to the watch
pt_br: Adiciona uma expressão ou variável a ser observada

source: Registers...
pt_br: Registradores...

source: Show CPU register contents
pt_br: Mostra registradores da CPU e seus conteúdos

source: Shared Libraries...
pt_br: Bibliotecas Compartilhadas...

source: Kernel Signals...
pt_br: Sinais do Kernel...

source: Gdb (debugger) commands
pt_br: Comandos do Gdb (depurador)

source: Frame info
pt_br: Informações do Frame

source: Add expression
pt_br: Adicionar expressão

source: Clear
pt_br: Limpar

source: Add Watch Expression
pt_br: Adicionar Expressão a ser Observada

source: Add expression to watch
pt_br: Adiciona uma nova expressão a ser observada

source: Modify Watch Expression
pt_br: Modificar Expressão em Observação

source: Modify watched expression
pt_br: Modifica a expressão atualmente em observação

source: Inspect/Evaluate Expression
pt_br: Inspecionar/Avaliar Expressão

source: Save changes to glade project "%s" before closing? Your changes will be lost if you don't save them.
pt_br: Salvar alterações para o projeto glade "%s" antes de fechar? Suas alterações serão perdidas se você não salvá-las.

source: started: n/a
pt_br: iniciada: n/a

source: stopped: n/a
pt_br: paralisada: n/a

source: started: %s
pt_br: iniciada: %s

source: stopped: %s
pt_br: paralisada: %s

# started: %s stopped: %s
source: started: %s \tstopped: %s
pt_br: iniciada: %s \tparalisada: %s

source: /View/Sorting/Done, Date, Priority
pt_br: /Ver/Ordenar/Executada, Data, Prioridade

source: /View/Sorting/Done, Priority, Date
pt_br: /Ver/Ordenar/Executada, Prioridade, Data

source: /View/Sorting/Priority, Date, Done
pt_br: /Ver/Ordenar/Prioridade, Data, Executada

source: /View/Sorting/Priority, Done, Date
pt_br: /Ver/Ordenar/Prioridade, Executada, Data

source: /View/Sorting/Date, Priority, Done
pt_br: /Ver/Ordenar/Data, Prioridade, Executada

source: /View/Sorting/Date, Done, Priority
pt_br: /Ver/Ordenar/Data, Executada, Prioridade

source: /_ToDo
pt_br: /_Tarefas

source: /ToDo/_New Task List
pt_br: /Tarefas/_Nova Lista de Tarefas

source: /ToDo/_Open Task List
pt_br: /Tarefas/_Abrir Lista de Tarefas

source: /ToDo/_Export to
pt_br: /Tarefas/_Exportar para

source: /ToDo/Export to/html
pt_br: /Tarefas/Exportar para/html

source: /ToDo/Export to/task list
pt_br: /Tarefas/Exportar para/lista de tarefas

source: /ToDo/_Hide or Show Window
pt_br: /Tarefas/_Ocultar ou Exibir Janela

source: /ToDo/_Preferences
pt_br: /Tarefas/_Preferências

source: /ToDo/_Edit Categories
pt_br: /Tarefas/_Editar Categorias

source: /ToDo/_Quit
pt_br: /Tarefas/_Sair

source: /Item/_Add
pt_br: /Item/_Adicionar

source: /Item/_Edit
pt_br: /Item/_Editar

source: /Item/_Remove
pt_br: /Item/_Remover

source: /Item/Remove _Completed Items
pt_br: /Item/Remover Itens _Completados

source: /_View
pt_br: /_Ver

source: /_View/_Sorting
pt_br: /_Ver/_Ordenar

source: /_Help
pt_br: /_Ajuda

source: /Help/_About
pt_br: /Ajuda/_Sobre

source: About gToDo
pt_br: Sobre o gToDo

source: gToDo is a small and simple todo list written in gtk+-2.0
pt_br: gToDo é uma pequena e simples lista de tarefas escrita em gtk+-2.0

# Summary: %s
source: Summary:\t%s
pt_br: Resumo:\t%s

# Due date: %s
source: Due date:\t%s
pt_br: Data de término:\t%s

# Due date: %s at %02i:%02i
source: Due date:\t%s at %02i:%02i
pt_br: Data limite:\t%s at %02i:%02i

# Priority: %s
source: Priority:\t\t%s
pt_br: Prioridade:\t\t%s

# Comment: %s
source: Comment:\t%s
pt_br: Comentário:\t%s

source: gtodo v%s gtodo has the following command-line options: -s\t--show\tShows a todo item by its ID. only useful for programs calling gtodo -?\t--help\tThis Message.
pt_br: gtodo v%s gtodo possui as seguintes opções de linha de comando: -s\t--show\tMostra um item de tarefa pelo seu ID. somente possui utilidade em programas que chamam o gtodo -?\t--help\tEsta Mensagem.

source: The --show option take a to do item ID as argument
pt_br: O comando --show pega o ID de um item de tarefa como um argumento

source: The following item is due: "%s"
pt_br: O seguinte item é obrigatório: "%s"

source: Hide items that are past _due date
pt_br: Ocultar os itens que ultrapassaram a _data limite

source: Hide items without an _end date
pt_br: Ocultar itens sem uma d_ata de término

source: Enable automatic messages indicators
pt_br: Habilitar indicadores automáticos de mensagens

source: Pick a color
pt_br: Escolha uma cor

source: Patch successful.
pt_br: A aplicação do patch teve sucesso.

source: Cannot open: %s &s
pt_br: Impossível abrir: %s &s

source: Cannot open: %s Does not look like a valid Anjuta project.
pt_br: Impossível abrir: %s Não parece um arquivo de projeto válido do Anjuta.

source: Loaded default profile...
pt_br: Perfil padrão carregado...

source: Loading project. Please wait ...
pt_br: Carregando o Projeto. Por favor, aguarde...

source: Tree
pt_br: Árvore

source: One or more files are not saved. Do you still want to exit?
pt_br: Um ou mais arquivos não foram salvos. Deseja sair mesmo assim?

source: This target does not have any profiling data. Please ensure that the target is compiled with profiling support (-p)and that it is run at least once.
pt_br: Esse alvo não tem dados de perfilação. Por favor, certifique-se de que o alvo tenha sido compilado com suporte a perfilação e que ele tenha sido executado pelo menos uma vez.

source: Stack
pt_br: Pilha

source: User
pt_br: Usuário

source: Command
pt_br: Comando

source: Unable to open %s. Debugger cannot start.
pt_br: Não foi possível abrir %s. O Depurador não pode ser iniciado.

source: Unable to detect mime-type of %s. Debugger cannot start.
pt_br: Não foi possível detectar o tipo mime de %s. O Depurador não pode ser iniciado.

source: Path
pt_br: Caminho

source: Ins_pect/Evaluate...
pt_br: Ins_pecionar/Avaliar...

source: Inspect or evaluate an expression or variable
pt_br: Inspeciona ou avalia uma expressão ou variável

source: Update all
pt_br: Atualizar tudo

source: Watches
pt_br: Observações

source: Contents
pt_br: Conteúdo

source: Help
pt_br: Ajuda

source: Help display
pt_br: Tela de ajuda

source: _Reload
pt_br: _Recarregar

source: Bookmarks
pt_br: Marcadores

source: Path:
pt_br: Caminho:

source: Open file
pt_br: Abre um arquivo

source: [read-only]
pt_br: [somente-leitura]

source: Editor tabs
pt_br: Tabulações do editor

source: Position:
pt_br: Posição:

source: Save session interval in minutes
pt_br: Intervalo da sessão de salvamento em minutos

source: Sorted by most recent use
pt_br: Ordenar pelo mais recentemente utilizado

source: Sorted in alphabetical order
pt_br: Ordenar alfabeticamente

source: Sorted in opening order
pt_br: Ordenar na ordem de abertura

source: Top Bottom Left Right
pt_br: Em cima Embaixo Esquerda Direita

source: _Save
pt_br: _Salvar

source: Save current file
pt_br: Salva o arquivo atual

source: Save the current file with a different name
pt_br: Salva o arquivo atual com um nome diferente

source: Close current file
pt_br: Fecha o arquivo atual

source: Close All
pt_br: Fechar todos

source: Close all files
pt_br: Fecha todos os arquivos

source: Reload current file
pt_br: Recarrega o arquivo atual

source: Print the current file
pt_br: Imprime o arquivo atual

source: _Print Preview
pt_br: Visualizar Im_pressão

source: Preview the current file in print-format
pt_br: Visualiza o arquivo atual formatado para impressão

source: _Transform
pt_br: _Transformar

source: Make the selected text uppercase
pt_br: Converte o texto selecionado para maiúsculas

source: Make Selection Lowercase
pt_br: Converter a Seleção para Mi_núsculas

source: Make the selected text lowercase
pt_br: Converte o texto selecionado para minúsculas

source: Convert EOL to CRLF
pt_br: Converter caracteres EOL em CRLF

source: Convert End Of Line characters to DOS EOL (CRLF)
pt_br: Converte caracteres Fim de Linha (EOL) em EOL DOS (CRLF)

source: Convert EOL to LF
pt_br: Converter caracteres EOL em LF

source: Convert End Of Line characters to Unix EOL (LF)
pt_br: Converte caracteres Fim de Linha (EOL) em EOL Unix (LF)

source: Convert EOL to CR
pt_br: Converter caracteres EOL em CR

source: Convert End Of Line characters to Mac OS EOL (CR)
pt_br: Converte caracteres Fim de Linha (EOL) em EOL Mac OS (CR)

source: Select all text in the editor
pt_br: Seleciona todo o texto no editor

source: Select the current code block
pt_br: Seleciona o bloco de código atual

source: Block comment the selected text
pt_br: Comenta em bloco o texto selecionado

source: Box comment the selected text
pt_br: Comenta/descomenta o texto selecionado em uma caixa

source: Stream comment the selected text
pt_br: Comenta/descomenta o texto selecionado em um stream

source: _Line Number...
pt_br: _Linha número...

source: Go to a particular line in the editor
pt_br: Vai para uma linha específica no editor

source: Matching _Brace
pt_br: I_dentificar a Chave Correspondente

source: Go to the matching brace in the editor
pt_br: Vai para a chave correspondente no editor

source: _Start of Block
pt_br: Início do _bloco

source: Go to the start of the current block
pt_br: Vai para o início do bloco atual

source: _End of Block
pt_br: _Final do bloco

source: Go to the end of the current block
pt_br: Vai para o final do bloco atual

source: Previous _History
pt_br: _Histórico anterior

source: Goto previous history
pt_br: Vai para o histórico anterior

source: Next Histor_y
pt_br: Próximo his_tórico

source: Goto next history
pt_br: Vai para o próximo histórico

source: _Quick Search
pt_br: Pesquisa rápi_da

source: Quick editor embedded search
pt_br: Busca rápida embutida no editor

source: Quick _ReSearch
pt_br: Pesquisar rapidamente de _novo

source: Repeat quick search
pt_br: Repete a pesquisa rápida

source: U_ndo
pt_br: Desfa_zer

source: Undo the last action
pt_br: Desfaz a última ação

source: _Redo
pt_br: _Refazer

source: Redo the last undone action
pt_br: Refaz a última ação desfeita

source: C_ut
pt_br: C_ortar

source: Cut the selected text from the editor to the clipboard
pt_br: Corta o texto selecionado do editor para a área de transferência

source: Copy the selected text to the clipboard
pt_br: Copia o texto selecionado para a área de transferência

source: Paste the content of clipboard at the current position
pt_br: Cola o conteúdo da área de transferência na posição atual

source: _Clear
pt_br: _Limpar

source: Delete the selected text from the editor
pt_br: Exclui o texto selecionado do editor

source: _White Space
pt_br: _Espaços em branco

source: _Line End Characters
pt_br: Caracteres de fim de _linha

source: Line _Wrapping
pt_br: _Quebra de linha

source: Enable/disable line wrapping
pt_br: Exibe/Oculta a quebra de linha

source: _Close All Folds
pt_br: Fe_char Todos os Folds

source: Close all code folds in the editor
pt_br: Fecha todos os folds de código no editor

source: Open all code folds in the editor
pt_br: Abre todos os folds de código no editor

source: _Toggle Current Fold
pt_br: Al_ternar o Estado do Fold Atual

source: Toggle current code fold in the editor
pt_br: Alterna o estado atual aberto/fechado do fold do código no editor

source: _Documents
pt_br: _Documentos

source: Previous Document
pt_br: Documento anterior

source: Switch to previous document
pt_br: Alterna para o documento anterior

source: Next Document
pt_br: Próximo documento

source: Switch to next document
pt_br: Alterna para o próximo documento

source: Bookmar_k
pt_br: Ma_rcador

source: _Add Bookmark
pt_br: _Adicionar marcador

source: Add a bookmark at the current line position
pt_br: Adiciona um marcador na posição da linha atual

source: Jump to the previous bookmark in the file
pt_br: Pula para o marcador anterior no arquivo

source: Jump to the next bookmark in the file
pt_br: Pula para o marcador seguinte no arquivo

source: Clear bookmarks
pt_br: Limpa os marcadores existentes

source: Editor file operations
pt_br: Operações do editor de arquivos

source: Editor print operations
pt_br: Operações de impressão do editor

source: Editor text transformation
pt_br: Transformação do editor de texto

source: Editor text selection
pt_br: Seleção do editor de texto

source: Editor code commenting
pt_br: Comentários do editor de código
